{"rating": 4.0, "title": "12 mg is 12 on the periodic table people! Mg for magnesium", "text": "This review is more to clarify someone else’s review bc they didn’t understand understand the labeling!  It shows 1000mg as advertised & another little label says 12mg bc 12 is on the periodic table for magnesium!  I realize not everyone takes chemistry, but 4 ppl liked his review & so misinformation is spreading.  This works. If however you are on opiate level medications that are causing constipation you should talk to your pain dr or your gastrointestinal dr & ask for a medication called Linzess which works must better & must faster, but is unnecessary for most people.  If magnesium is working for you just make sure to take it with food & drink 6-8 glasses of water per day.  Staying hydrated will really help.  Before switching to Linzess I used to take one 1,000 mg pill am & pm every day with meals & always with an 8 ounce glass of water or other liquid.", "images": [], "asin": "B07TDSJZMR", "parent_asin": "B07TDSJZMR", "user_id": "AFKZENTNBQ7A7V7UXW5JJI6UGRYQ", "timestamp": 1580950175902, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "Save the lanet using less plastic.", "text": "Love these easy multitasking bleach tablets. Beats carrying home a big old jug of bleach.Walmark has been out of them since pademic hit and was so glad to find hear.", "images": [], "asin": "B08637FWWF", "parent_asin": "B08637FWWF", "user_id": "AEVWAM3YWN5URJVJIZZ6XPD2MKIA", "timestamp": 1604354586880, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "Fantastic", "text": "I have been suffering a couple months with heel pain from plantar fasciitis.  I thought I'd give these a try and wow, I was surprised at how much they cut down on the pain.  I wish they came in a tighter and thicker version.", "images": [], "asin": "B07KJVGNN5", "parent_asin": "B07KJVGNN5", "user_id": "AHSPLDNW5OOUK2PLH7GXLACFBZNQ", "timestamp": 1563966838905, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "It holds the water and makes bubbles.  That's what I bought it for.", "text": "It's cheap and it does what I wanted.  The \"massage\" function is a joke though.  It comes with 3 little plastic parts that you can scrape your feet on.  Not sure why they even bothered with that.  But it's nicer than sticking your feet in a plain tub.", "images": [], "asin": "B007HY7GC2", "parent_asin": "B092RP73CX", "user_id": "AEZGPLOYTSAPR3DHZKKXEFPAXUAA", "timestamp": 1662258542725, "helpful_vote": 7, "verified_purchase": true}
{"rating": 1.0, "title": "Not for me", "text": "Didn't do a thing for me. Not saying they don't. just not for me..", "images": [], "asin": "B08KYJLF5T", "parent_asin": "B08KYJLF5T", "user_id": "AEQAYV7RXZEBXMQIQPL6KCT2CFWQ", "timestamp": 1642722787262, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Every home should have these", "text": "I have never been big on vitamins, with the exception of the occasional multi-vitamin. However, during the pandemic, I started on a daily regimen of taking Vitamin C, Vitamin D3 and Zinc every morning and an additional Vitamin C at night. This is a large bottle of three hundred tablets (enough to last me for three months). I typically take all my vitamins on an empty stomach and I have had no ill side effects from doing so. Everyone should be taking these daily to strengthen your immune system (even if you are vaccinated). Highly recommend!", "images": [], "asin": "B09GBMG83Z", "parent_asin": "B09GBMG83Z", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1645402494796, "helpful_vote": 1, "verified_purchase": false}
{"rating": 4.0, "title": "Versatile shaver", "text": "To be honest, my husband did not use this for a balding head. He wanted to try it for his face and for nose/ear hairs. This is his review. This was a nice man's shaver. It has several attachments which are easy to change out and install. The shave I got was super close and it was easy to maneuver it over the contours of my face. I have to admit it is one of the best shaves I have had in the past few years and for the money it is a good deal. The nose trimmer worked well with no pain or irritation. Highly recommend.", "images": [], "asin": "B09FKT5PQ9", "parent_asin": "B09FKT5PQ9", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1644266326005, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Makes a nice compact noise machine to take with you when traveling", "text": "This is a nice basic sound machine. I have used sound machines for years now to aid in getting a quality night's sleep. I have been using Alexa for the past year or so for my sound machine, so I was actually looking for a machine I could take with me when I travel. This is really nice, super compact and can go everywhere. My deduction of a star is only because of the loop, I can her it when the system reaches it's 90 second interval. However, once I am asleep it is barely noticeable and has not disturbed my travel sleep. I will keep this is my overnight bag and will continue to use it when away from home.", "images": [], "asin": "B08THJD1MH", "parent_asin": "B08THJD1MH", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1617907534645, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Great drawstring holiday bags!", "text": "This are super colorful great gift giving holiday bags and tags. I always give smaller gifts to neighbors (sometimes home made baked goods, sometimes a bottle of wine). These bags are perfect for this. The drawstring is made of ribbon and seals the bag well. These would also be great for packaging teacher's gifts or for family gifting. Highly recommend. Nice variety, nice colors!", "images": [], "asin": "B08FCQML37", "parent_asin": "B08FCQML37", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1608066939529, "helpful_vote": 0, "verified_purchase": false}
{"rating": 3.0, "title": "Not as good as the name brand whitening strips but they do work", "text": "I guess the only product I have in my history of teeth whitening is Crest strips. These do not truly compare to them. These did not cling as well to my teeth as the Crestdo (I had to keep readjusting to assure they would stay in place). As far as actual whitening, I did see a slight improvement in the whiteness of my teeth. The big plus here is that these are about 1/2 the price of Crest. So, if you are looking to save some money, these might be great for you.", "images": [], "asin": "B08GYM3HVP", "parent_asin": "B08GYM3HVP", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1602710718369, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Great hair dryer gets the job done quickly!", "text": "This Jinri hair dryer is among one of the best I have ever owned. Strong and powerful, my hair dries super quick. It has varying speeds and heat levels which allows me to dry and style my hair at the same time. It also fits well in my hand, is relatively light weight, and I can maneuver from the front to back of my head easily. I love this red color as well and it matches my decor perfectly. Highly recommend if you are in the market for a new, quality hair dryer at a reasonable price.", "images": [], "asin": "B0895LW9LL", "parent_asin": "B0895LW9LL", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1601757145389, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Beware of the sizing on these", "text": "For positives, these are really nice, soft leggings. Super stretchy, high waisted and a deep rich black color. For negatives, they are too small for me. I am 5'7\" and weigh about 150 lbs and they do not fit comfortably (definitely too tight). I will be washing them and giving them to my daughter in law who is much thinner. I really liked these, just too bad they aren't a tad more stretchier.", "images": [], "asin": "B07W51YFGQ", "parent_asin": "B07W51YFGQ", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1568976096968, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Great reasonably priced shower filter!", "text": "I live in Florida where hard water is definitely an issue. I just purchased my house last September, and recently retired, and I am trying to be careful on spending money. Many of my neighbors have been installing whole house water systems and although I do think at sometime in the future I will look into it, this filter has helped me at least in the shower. I can tell the water is better since I installed it (yes, installation was super easy for me) and my hair feels so much softer and I see less spots on the shower glass doors. For the money, this is a great shower filter and I highly recommend it.", "images": [], "asin": "B07PKLN99K", "parent_asin": "B07PKLN99K", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1559421381258, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Great vitamin supplement to add to your smoothie routine!", "text": "Great way to supplement your daily smoothie/fruit/veggie shake with vitamins. Given that this is certified organic, Vegan & Non-GMO, it is a great all natural way to give your body an extra boost of Vitamin C. I am deleting a star simply because when I first tried to mix this in just juice, I saw that the powder does not mix well (my juice was cloudy). However, I started instead to mix it with my smoothies and it worked perfectly. No taste, blends well when the mixture is thicker.", "images": [], "asin": "B07J3F4KLJ", "parent_asin": "B07XVVVB8W", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1549019442625, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Great daily vitamin for the older woman's body!", "text": "This is my new favorite daily vitamin. Totally Vegan, easy to swallow and fills all the daily requirements of my 60+aged body. I have a tendency to skip breakfast most days a week and this vitamin agrees with an empty stomach (no aftertaste, burping, or unpleasant stomach rumblings). This is a lot cheaper than my usual Centrum formula so Amazon has once again turned me away from name brands and over to their store brand names. I highly recommend for any woman over age 40 who cares about their health!", "images": [], "asin": "B075DLLC57", "parent_asin": "B0C6H6RRVB", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1515869747736, "helpful_vote": 4, "verified_purchase": false}
{"rating": 5.0, "title": "Great probiotic and great taste, too!", "text": "I have a mild form of IBS and have been taking probiotics (in pill form) for years now. I thought I would try something different by using a chewable variety and I was thrilled when I saw this. I was a little skeptical with the title of 'Dark Chocolate' and it brought back memories as a kid of chocolate Ex-lax flavoring. Boy, was I pleasantly surprised! The flavor of this chewable probiotic is absolutely amazing. It actually makes me look forward to taking my daily probiotic to help keep my IBS in check. Since taking this, I do feel better and my bloating issues have definitely decrease. As we all know probiotics are good bacteria and everyone (even without IBS issues) should be taking probiotics daily just to help your digestive system perform optimally. If you are looking for a type of probiotic that you can actually like taking, and you love chocolate, this Digestive Advantage Dark Chocolate will definitey fill the bill!", "images": [], "asin": "B06XSX3DMW", "parent_asin": "B06XSX3DMW", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1496869465412, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Great taste, consistency and supports my workout regime totally!", "text": "Great pre and post workout mix. Yes, it has aspartane but then again, the last thing I want in my diet is more sugar. I thought the taste was a little sweet, so I did dilute this more than the recommended mixture (you will probably need to do the same depending on your taste). High in electrolytes and protein, this is great for my Florida workouts with the heat and humidity (and I lose more water sweating than in probably any other area of the country). I was previously a Gatorade drinker, but I honestly prefer this Science in Sport and will be buying more.", "images": [], "asin": "B01N9SEOSO", "parent_asin": "B07NPNNR3P", "user_id": "AFSKPY37N3C43SOI5IEXEK5JSIYA", "timestamp": 1492784666000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "returned", "text": "it was a nice tray  smaller than i expected but my walker has  rubber grips and the tray didnt fit over it  - now what do i do ?  buy a new walker ?  idk what to do to be honest  im assuming all trays will have the same issue due to those grips  companies should realize walkers come with grips and make the trays fit either or somehow", "images": [], "asin": "B01H0SVP9O", "parent_asin": "B01H0SVP9O", "user_id": "AHGAOIZVODNHYMNCBV4DECZH42UQ", "timestamp": 1605106494192, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Love this!", "text": "This not only provides a nice scent, but it's also a great way to disinfect & remove wrinkles.<br /><br />Please Lysol, never stop making this, it's an amazing product!", "images": [], "asin": "B09HR8V212", "parent_asin": "B09HR8V212", "user_id": "AGC3Q6IXOVLTTDMS4Q55FPYUF6FQ", "timestamp": 1669512086580, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "Best smoothing & shaping set out there!", "text": "I love this set & definitely will be purchasing more in the future! This set has everything you need to smooth & shape the nails. I highly recommend!", "images": [], "asin": "B07N5MY8DL", "parent_asin": "B07N5MY8DL", "user_id": "AGC3Q6IXOVLTTDMS4Q55FPYUF6FQ", "timestamp": 1571494449680, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Very good product.", "text": "Does a great job cleaning.", "images": [], "asin": "B00BR1FSU8", "parent_asin": "B00BR1FSU8", "user_id": "AHY7ZJB523OPTIKXRI63PS2V6FSQ", "timestamp": 1555783483017, "helpful_vote": 0, "verified_purchase": true}
{"rating": 1.0, "title": "talc free body spray", "text": "Purchased this for my husband because it would be less messy than regular powder.  It IS less messy than regular powder, however, it doesn't work as well.  And it is oddly... greasy?  He reports that it is lotiony in a weird way.  Since you usually use powder to keep areas and creases dry.  If it's lotiony or greasy, not so much.<br />If you're hoping for a replacement for powder - this isn't it - at least in my husband's opinion.", "images": [], "asin": "B08W5FL1BT", "parent_asin": "B08W5FL1BT", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1623962349505, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "xl face mask", "text": "My husband is a big guy with a beard - further - in my opinion - an unusually large head.  So finding washable masks for him as been a real challenge.  These masks are really big.  Fully cover his nose, face and beard.  He really like the comfort of the ear loops which are also part of the \"adjustablity.\"  I am not a huge fan of the hanging mask (for sanitary reasons - \"don't mess with your mask\" etc)  BUT it does keep the mask from being put down - possibly leaving germs on surfaces - and then picking them up again.  They are washable - highly important to me.  They are simple black.  Nothing fancy.  The point is, they will work.  I never hesitate to update my reviews should new info seem useful.  Having said all of that, I just ordered 1/2 a dozen more for him to use.", "images": [], "asin": "B08BWBQ3T3", "parent_asin": "B08K2MYBZY", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1604192177518, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "rubber kitchen gloves", "text": "In this day and age of excessive hand washing - I HAD to have some of these to save my poor, cracked over washed hands - still have to do the dishes.  They are extra long.  I consider myself to have a medium size hand and they are snug - but not too.  Comes with a set of 3 in 3 different colors -- that happen to work for spring right now - but who really cares.  My hands are grateful.", "images": [], "asin": "B07WBY2HPZ", "parent_asin": "B07WBY2HPZ", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1586720417356, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "glucose tabs", "text": "Husband is type 2 diabetic and with the combo of meds he takes, occasionally low blood sugar is a thing.  These are easy and measured.  He really likes the grape taste, but lets face it, they are really an emergency fix - so taste makes it easier to get down - which is what is most important.  The travel tube is very handy.", "images": [], "asin": "B01MRWVRV9", "parent_asin": "B01MRWVRV9", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1565065084113, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "baking soda shakers", "text": "Good price, effective, refillable.  I use these for soft scrubbing cleaning.  Keep one in the kitchen and each bathroom.  I purchase the bulk bag of baking soda to refill the shakers.  A great companion purchase.  Add a little vinegar to the sink or whatever you are cleaning with baking soda for a disinfecting property.  All natural.  I never hesitate to update my reviews should new info seem useful.  And I hope this info was helpful to you!", "images": [], "asin": "B0009Q63C4", "parent_asin": "B0CDDBK2G4", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1548087297342, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "bath brush", "text": "Husband likes these because the bristles are pretty stiff... he likes a nice, firm back scrubber.  They seem to hold up.  I will update should new info seem useful.", "images": [], "asin": "B0107RUU5U", "parent_asin": "B0107RUU5U", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1518477184746, "helpful_vote": 0, "verified_purchase": true}
{"rating": 1.0, "title": "long handled shoe horn with spring", "text": "I thought the &#34;adjustability&#34; of this shoe horn would be good.  And it might have been... EXCEPT for the spring just above the horn.  It makes the shoe horn completely unusable as it bends at the spring!  So... your foot won't slide into the shoe!  If you need a little extra length because bending over is an issue, definately go for the solid, long handle.  I just pitched this one and purchased a solid long handle shoe horn.  Works like a dream.  For the life of me I cannot imagine how anyone thought this one would work.  Garbage.", "images": [], "asin": "B00T6NJGAW", "parent_asin": "B07K8G552L", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1513280770734, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "fabric gift bag", "text": "Very nice.  Looks just as pictured.  I put a yarn project keeper, some yarn and a couple other small items without trouble.  The measurements given were active.  The ribbon is lovely, thick satin ribbon and is white.  Plenty of it with lots of tail after closing the top.  The material of the bag is thin, but effective - I can't see through it.  I would buy again.  It's a lovely, reusable gift bag. It arrived quickly (I have prime) and in great shape along with other items I ordered.", "images": [], "asin": "B0733X13BS", "parent_asin": "B0733X13BS", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1510078336643, "helpful_vote": 1, "verified_purchase": true}
{"rating": 1.0, "title": "Swab whitener", "text": "First... I purchased these directly from the manufacturer - thus it doesn't say &#34;verified&#34; purchase for me.  I went to the manufacturer because I wanted to try a smaller set (1 month set) which was not offered on Amazon when I purchased it.<br />1.  A &#34;one month supply&#34; is really only a one WEEK supply - the &#34;effects&#34; are supposed to last one month.  Misleading to say the least.  Should say it's a ONE WEEK supply.<br />2.  I took pictures that show NO difference to my eye.  NOTE:  I used exactly as described on instructions.  ALSO... my front, top 4 teeth are 15 year old porcelain overlays.  Supposedly this system is safe AND effective on dental work as well as natural teeth.  I didn't see it.<br />3.  It is messy and a two step process... Tube # 1 is the a super stain treater and then tube #2 which you apply after using tube #1.  The pic I have included was after tube #2.  NOTE:  The tubes themselves were a serious pain... most of the time they were extremely difficult to get open even with &#34;careful bending&#34; per instruction.  I think I had ONE tube that actually opened without considerable force, which causes the swab to be displaced making it more difficult to apply the treatment.  They also include a tube that you are to use while you are out and about and have eaten or had something to drink that could be potentially staining.  It has a soft brush like tip.<br />4. Initially the solution didn't really effect me one way or the other, however by the end of the 7 days my gums were very sensitive.  I have a sonic toothbrush with an all purpose name brand toothpaste and brushed my teeth prior to each treatment, which I chose to do in the mornings.<br />5.  It is obviously a peroxide formula of some sort.  You can taste it.  With a bit of mint or something mixed in... but there is no hiding the peroxide flavor.<br />6. In the end, photos don't lie.  I don't see any improvement at all.  Photo number 1 is before... Feb 17... Photo number 2 is Feb 23.  The rest were photos I would like to see if I were considering a purchase.  Hope it helps.<br />In my opinion these are a waste of time AND money. I included the photos so you could make your own decision.  I never hesitate to update my reviews should new info seem useful, but honestly, I will not be buying these again either from the manufacturer or from Amazon.", "images": [{"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/51PlRKBNT5L._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/51PlRKBNT5L._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/51PlRKBNT5L._SL1600_.jpg", "attachment_type": "IMAGE"}, {"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/617JRsNcPXL._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/617JRsNcPXL._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/617JRsNcPXL._SL1600_.jpg", "attachment_type": "IMAGE"}, {"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71KfvymduCL._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71KfvymduCL._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71KfvymduCL.jpg", "attachment_type": "IMAGE"}, {"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81bfCD2Z7tL._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81bfCD2Z7tL._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81bfCD2Z7tL.jpg", "attachment_type": "IMAGE"}], "asin": "B01G5Y5900", "parent_asin": "B01G5Y5900", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1487875708000, "helpful_vote": 541, "verified_purchase": false}
{"rating": 5.0, "title": "toenail clippers", "text": "Bought these for my husband.  They have a good grip and were easy to hold onto.  I also likes that they have a larger clip area as your toenails are larger than your finger tips, general speaking.  They are heavy and sharp.  I feel as though they will last for some to come. I never hesitate to update my reviews if new info should seem useful.  They arrived quickly (I have prime) and in good condition along with a few other things I had ordered.", "images": [], "asin": "B013DFUSB4", "parent_asin": "B013DFUSB4", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1481755914000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "works", "text": "I got this to help with a edible tincture and it works very well.  I must say that a small portion goes a long way.", "images": [], "asin": "B004C7MTLA", "parent_asin": "B004C7MTLA", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1386640603000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 4.0, "title": "Retro style", "text": "I bought these to wear when I take my contacts out.  FYI, they are a little wide.  I am a girl and I think they are meant for big headed boys.  :)  All the same, I love the style.  Just wish they were a little bit tighter at the temples.  The appear to be good quality and I don't see any distortion in the lens.", "images": [], "asin": "B004ZIEXOW", "parent_asin": "B004ZIEXOW", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1368753668000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "very happy with purchase", "text": "was just as described, very happy with purchase.", "images": [], "asin": "B00CGBBXCU", "parent_asin": "B00CGBBXCU", "user_id": "AEDRFOIY6IFY7DWSPRRNGEFIFE2Q", "timestamp": 1421930039000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Removes odors", "text": "Removes odors effectively and has a nice smell.", "images": [], "asin": "B00NL6ZYNS", "parent_asin": "B0BTLP552N", "user_id": "AFKNVFEXRGUGJAGMENCOWLVDYVCQ", "timestamp": 1597857212021, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Jury still out", "text": "Jury still out. Getting used to.", "images": [], "asin": "B07Z85382Y", "parent_asin": "B07Z85382Y", "user_id": "AGYWDTDUSHHZEHTF456VJTOVOKYA", "timestamp": 1579230738395, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Perfect for work and travel", "text": "I bought two of these. I have an expensive one at home and needed something smaller and less money for work and for when I travel. Though it may not be \"as powerful\" as my expensive one at home, it does the job. I keep the one at work in a cosmetic bag, with toothpaste, toothbrush and a small mouthwash and it's perfect to tote to the restroom after lunch and keeping my teeth clean. The other is in my travel cosmetic case, so when I go out of town - I just charge it up and off I go. For $9.99, you can't beat the price.", "images": [], "asin": "B09MRL55ZJ", "parent_asin": "B09MRL55ZJ", "user_id": "AFXDYTFXJLX4YG3UD7W23W7Z5Y4A", "timestamp": 1656556984250, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Three Stars", "text": "More of a dull gold vs bright gold", "images": [], "asin": "B01FRTOJQ4", "parent_asin": "B01FRTOJQ4", "user_id": "AFWTME2ROGUQI5J5FB3DWCLKZNBA", "timestamp": 1493267069000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "great", "text": "very  nice  bags,  elegant  look  and  excellent  packing in  its  own  wrapped  box.  I  have  purchased  again, and  you  will  be  happy", "images": [], "asin": "B08F1YCD41", "parent_asin": "B08F1YCD41", "user_id": "AG6SNHIVEFMJIXCLZWKTGEOV5ZBQ", "timestamp": 1618782315547, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Great value for great compression socks!", "text": "The first time I used these socks, they were difficult to pull on, but after washing were easier, and so worthwhile!", "images": [], "asin": "B07VVWWJMV", "parent_asin": "B07VVWWJMV", "user_id": "AHKIMFUXMLOUN7SBXHEDD2K2AN7Q", "timestamp": 1577828814231, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Fast and reliable shipping! Great product!", "text": "I got this for my mom as a gift and she loves it! Crap i love it! Fast shipping too! Will buy again!", "images": [], "asin": "B00V0249MC", "parent_asin": "B0B4328BFW", "user_id": "AEZSZS7UV44CAJJR5FNEM4DZCWTQ", "timestamp": 1590104307325, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "really nice", "text": "good size and sturdy", "images": [], "asin": "B07SKK3G4J", "parent_asin": "B07SKK3G4J", "user_id": "AGVVUU3QRQBHNASSGI5YQLPYOI2Q", "timestamp": 1603363847234, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Tastes okay; a little hard to mix; lots of good ingredients", "text": "I give this a solid 4-stars because it contains lots of good ingredients and tastes reasonably good.  I thought it seemed to help my digestive system, but haven't taken it long enough to know for sure.  The only problem that I found with this is that it doesn't mix up really well in a glass of water.  You have to stir it quite a bit and you still seem to have small pieces and residue that doesn't mix in well.  This is the first time I have really tried a \"superfood\".  I tried the green one (vegetable mostly), but am thinking of also trying the red (more fruit, I assume).  For less money, you can probably buy fruits and veggies that will give you the same nutrition, but this may be more concentrated and probably a decent partial substitute for not eating correctly.  The only bad ingredient that I could see is that it contains some sugar.", "images": [], "asin": "B07D7YRNTZ", "parent_asin": "B09Q9BFGPD", "user_id": "AFAIJYOUO3NAWLBDIKTQSC3DASWA", "timestamp": 1554310565806, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Stays strong!", "text": "Love this product!!!! Will order more. So easy to use & stays strong", "images": [], "asin": "B071ZNGVVY", "parent_asin": "B071ZNGVVY", "user_id": "AFPBVAEV3FCQOHKJJGAKQLZLTCZQ", "timestamp": 1577486041725, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A little difficult for kids to use", "text": "A little difficult for kids to use but ok for the price", "images": [], "asin": "B01GR40MJQ", "parent_asin": "B01GR40MJQ", "user_id": "AFPBVAEV3FCQOHKJJGAKQLZLTCZQ", "timestamp": 1569202056742, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Seems to do what it says, but didn’t work for me.", "text": "Unfortunately I’m returning this item. I tried it on and it was fairly simple to figure out how to adjust it. It definitely felt like it was pulling my shoulders back and I could instantly feel a bit of relief from my poor posture. However once on and snug, it cuts into my arm pit area too tightly. It may be my size or my sensitivity level. I’m a female, 5 1’ and weigh about 125. I don’t not recommend this product since it seems like it would be effective, it just wasn’t for me.", "images": [], "asin": "B082G5X2F1", "parent_asin": "B082G5X2F1", "user_id": "AHY55PORR7VYL72JBUYNSO6KCA5A", "timestamp": 1589930763896, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "Very strong and well made", "text": "While this didnt seat on my walker bars well, it worked great for picking things up.I got the 26 inch one because the 36 in. one picked up good but it was a long reach to grab what I picked up. This one is perfect! It is a very sturdy piece of material especially the grabbing fingers. There is a rubber coating so what you pick up, doesnt slip out.", "images": [], "asin": "B0824TJ5HG", "parent_asin": "B0824TJ5HG", "user_id": "AFFZVSTUS3U2ZD22A2NPZSKOCPGQ", "timestamp": 1578719519668, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Works", "text": "My uses it everyday", "images": [], "asin": "B018VNTBVQ", "parent_asin": "B018VNTBVQ", "user_id": "AHSAUHUTLVNKJ72GUIPGI5XZH6ZA", "timestamp": 1546721753490, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Good sturdy 4 ounce cup", "text": "I’ve only used these cups a few times as my husband shares his coffee with me & this cup & amount is perfect.<br />I previously bought another brand that came with a clip on handle and they are okay for store sampling, one time use, but since I could feel the hot coffee, I had to use two.<br />These cups are thicker & sturdier as I’ve used them multiple times since my husband makes 3-5 coffees per day, depending on if we share them and I’ve haven’t had to replace the cup because of multiple uses even if it sat for awhile in between cups.<br />I would definitely recommend and I would definitely rebuy.", "images": [], "asin": "B071P8W7VJ", "parent_asin": "B071P8W7VJ", "user_id": "AHE2H77LQCUDXIXFI46LFDCVKJNQ", "timestamp": 1564952205175, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Good value great for goodie bags", "text": "Very satisfied with this purchase. For the price it's a great value and cheaper then the party stores I think. Only a handful were broken and out of 250 items I tho k that's good. Didn't know it had so many tattoos though and is mostly the slappy sticky toys", "images": [], "asin": "B01NBBW4LH", "parent_asin": "B01NBBW4LH", "user_id": "AH4CGRSYSW5CWLRGQYRZKNJBUPAA", "timestamp": 1515692474355, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "These taste ok, but they are very hard to chew", "text": "These gummies aren't soft at all.  They are hard and stick to the teeth.  The flavor is good and the fiber is good, but just much to hard.", "images": [], "asin": "B09JB33NY1", "parent_asin": "B09JB33NY1", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1645557925875, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "I love that it's made in the USA", "text": "This product is relaxing.  It is a little expensive, but it's nice and soothing.  It's made in the USA.<br />I would buy this product again.", "images": [], "asin": "B093Q55FW9", "parent_asin": "B093Q55FW9", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1637288534401, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Helps give relief", "text": "I'm kind of between a 6 and a 6 1/2 so some shoes are too tight and some are a little loose.  These pads help with the 6 1/2 for the ones that are a little loose. Adds a bit more comfort for long wear.", "images": [], "asin": "B07D4B4CZQ", "parent_asin": "B07D4B4CZQ", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1623416040244, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "These are cute and serve their purpose", "text": "Great for little ones. The color holds well and the design is cute.", "images": [], "asin": "B08DXD76HB", "parent_asin": "B08DXD76HB", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1614215920590, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Fit well", "text": "These fit as expected and fit well.  They are snug as to be expected with compression socks.  The color and style are cute. They wash well", "images": [], "asin": "B07YVHTQ56", "parent_asin": "B07YVHTQ56", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1591758730899, "helpful_vote": 0, "verified_purchase": false}
{"rating": 3.0, "title": "Has good stimulation, but doesn't stay in place very well.", "text": "Even when sitting the tabs come off.  They don't stick well.  The TENS unit stimulates like it's supposed to, but even when just sitting still the pads come off. they need better adhesive.<br /><br />The unit isn't rechargeable.  You have to use batteries.  You can buy rechargeable batteries for it.", "images": [], "asin": "B07R3SKKQP", "parent_asin": "B07R3SKKQP", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1567740061025, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "My favorite protein powder", "text": "Blends great, very subtle flavor. I've used it for smoothies, but when I realized it doesn't taste awful, I started using it to cook toaster-sized protein pancakes to store in my freezer.", "images": [], "asin": "B0792Q3V64", "parent_asin": "B0792Q3V64", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1561565127799, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "(y)", "text": "Blended well into my smoothies. Not much taste difference with the other vegetables and things.", "images": [], "asin": "B07J32R15F", "parent_asin": "B07XVVVB8W", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1561564859667, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "This selfie stick works great", "text": "The selfie stick is easy to use and easy to hold.  I love that it has the bluetooth remote.  So much easier than setting the timer for selfies. It extends to a good length and the tripod is a great bonus!  Love everything about it!", "images": [], "asin": "B07L1R72FT", "parent_asin": "B07L1R72FT", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1556204792004, "helpful_vote": 0, "verified_purchase": false}
{"rating": 1.0, "title": "Nice product. Only one pack in box, not 12.", "text": "These wipes are great!  I love that they are flushable.  They clean well and have a pleasant scent.  These are portable packages.  I like the idea that you can throw them in a bag without having a bulky, plastic, space hog container. After problems with the septic tank, these are not good for the septic tank. I'm sure they eventually dissolve but not right away.<br /><br />You must know... The listing says it comes with 12 packs, it only comes with ONE.  In which case, you have to return the one package to receive a credit.  I didn't return mine in time, therefore, I paid $22+ for only one pack of wipes.  Not sure how this became my fault, but it is what it is.", "images": [], "asin": "B003FGE1TC", "parent_asin": "B0BR84SRTX", "user_id": "AHATA6X6MYTC3VNBFJ3WIYVK257A", "timestamp": 1488041245000, "helpful_vote": 5, "verified_purchase": true}
{"rating": 3.0, "title": "If I need to be honest ... Meh", "text": "I don't hate these but I don't love them either, they are okay but they don't curl my eyelashes as good as others I've used before, they just don't, they barely curl them at all not sure why and my assumption is that they just don't curl your eyelashes very well. On the flip side they are easy to use and do not slide while you're using them (at least hasn't happened so far) so that is a good thing I guess, if that is what you're looking for. Also they do come with refills and everything else so that's also a good thing. I personally have had quite a few moments where I have trouble using curlers sometimes so these are good in that aspect, but other than that I'd say they don't really curl very well.", "images": [], "asin": "B085TQFQG2", "parent_asin": "B085TQFQG2", "user_id": "AFA26DYXVLJYTYZ3KET77GE27N2A", "timestamp": 1590798889815, "helpful_vote": 0, "verified_purchase": true}
{"rating": 2.0, "title": "Really terrible soap, good for decoration only. Not happy.", "text": "Not a fan of this, it's very nice to stare at or as decoration for the bathroom, the little cup they come on is cute and they look pretty, bu otherwise as far as soap goes it comes apart super easily. I would have to say 1 soap lasted me for about 2-3 times on the shower. Honestly I only took them to see if they were nice and they fall apart super easily also have a rough texture to them which is kind of strange considering they come apart really easily. The soap doesn't feel like soap at all though and doesn't make a lot of bubbles either it's just weird. In my opinion if you want it as a visual for your bathroom or just for decorating it's really fine but as far as soap goes, I'm sorry to say, one of the worst I've bought so far :s", "images": [], "asin": "B06XK13PY5", "parent_asin": "B06XK13PY5", "user_id": "AFA26DYXVLJYTYZ3KET77GE27N2A", "timestamp": 1510615058620, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Quick Dissolving!", "text": "I have been adding collagen powder to my coffee for over a year now. I really like this one. It is undetected once in my hot cup of coffee. It dissolves very quickly and leaves no clumping. I have noticed improvement in my knees and lower back since using collagen. I will keep taking it for as long as I can!", "images": [], "asin": "B0B94QF3L9", "parent_asin": "B0B94QF3L9", "user_id": "AHV6QCNBJNSGLATP56JAWJ3C4G2A", "timestamp": 1665018350939, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Easy to Read Display", "text": "I have high blood pressure. I have a wrist monitor, but I wanted a full size one. This one has a large, easy to read display. It seems to be pretty accurate. I am on medication for my hypertension and my results from it seem to be as expected. Batteries are included. It also can be charged with a USB C cable (included).", "images": [], "asin": "B0B9121DFX", "parent_asin": "B0B9121DFX", "user_id": "AHV6QCNBJNSGLATP56JAWJ3C4G2A", "timestamp": 1664050855583, "helpful_vote": 0, "verified_purchase": false}
{"rating": 3.0, "title": "Not Sure I'm Using it Correctly", "text": "I have had a lot of blackheads lately and have been looking for ways to deal with them. I saw this and thought it was interesting. After several attempts, I'm not sure that I am using it correctly. The directions really aren't that helpful. My first attempt was painful! I had the device suctioning a blackhead and then I couldn't get the device off! I finally figured out how to turn it off and was able to release it, but it hurt! Luckily it didn't leave any lasting marks. I'm going to look up some videos to see if that helps me before I give up on it.", "images": [], "asin": "B098T3VCHV", "parent_asin": "B098T3VCHV", "user_id": "AHV6QCNBJNSGLATP56JAWJ3C4G2A", "timestamp": 1640013686718, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Filling", "text": "My husband makes a meal replacement shake for breakfast every morning. This plant based one has 15 servings in it. It mixes well with water. He does use a blender for the job. He usually adds some frozen blueberries. It's palatable. It does taste a bit \"green\" as many other plant based protein powders do. He says it's filling and satisfying.", "images": [], "asin": "B08QDTTHFN", "parent_asin": "B08QDTTHFN", "user_id": "AHV6QCNBJNSGLATP56JAWJ3C4G2A", "timestamp": 1624574168053, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Helpful!", "text": "I am just getting over the worst hemorrhoids of my life! I have had them a few times in the past, but nothing like this time. The itching & burning was excruciating! This has been quite helpful! This fits on the toilet without any problems. It's deep enough that you can add enough water to actually sit in. It collapses flat for storing. This is just the seat and does not come with any hose or spray attachment. I found that I didn't need that and this was more than sufficient.", "images": [], "asin": "B08XXC2L7D", "parent_asin": "B08XXC2L7D", "user_id": "AHV6QCNBJNSGLATP56JAWJ3C4G2A", "timestamp": 1621547423498, "helpful_vote": 6, "verified_purchase": false}
{"rating": 4.0, "title": "Customizable", "text": "My daughter likes to wear stylish sneakers that don't have a lot of arch support. She recently came home from college for a visit and only brought the shoes she wore with her which happened to be a pair of these shoes. She was using our home elliptical machine and complained afterwards because the shoes weren't very supportive. I ordered these for her to see if they would help. These inserts are customizable. They can be trimmed for fit and then there are little pieces that you can add under the arch area in case you need to increase the arch support. She says that they do improve the arch support, but she would prefer one with extra cushion support in the heel and other areas, too. Overall, she does like these and is much happier with her shoes since she's added these.", "images": [], "asin": "B08P2W774Y", "parent_asin": "B08P2W774Y", "user_id": "AHV6QCNBJNSGLATP56JAWJ3C4G2A", "timestamp": 1613830955862, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Really the Best!", "text": "I have tried a few similar silicone face mask brackets and I feel that these really are the best! What makes them stand apart from the rest is the silicone strap. Basically, you are wearing 2 separate things - the bracket and your mask. After nearly a year of wearing masks, I have found these to be the most helpful when it comes to preventing my glasses to fog up. The silicone is very soft and non-irritating. The storage cases are an added bonus in my opinion. Love these!", "images": [], "asin": "B08M3TF9LT", "parent_asin": "B08M3TF9LT", "user_id": "AHV6QCNBJNSGLATP56JAWJ3C4G2A", "timestamp": 1612374087303, "helpful_vote": 0, "verified_purchase": false}